Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32WM_BZ6602.svd
            <register>
               <name>CFGPGQOS1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPGQOS1SET</name>
               <description>Bit set register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPGQOS1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x5c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPGQOS2CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPGQOS2SET</name>
               <description>Bit set register</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPGQOS2INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x6c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGI2CCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGI2CSET</name>
               <description>Bit set register</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGI2CINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x7c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN1SET</name>
               <description>Bit set register</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x8c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN2CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN2SET</name>
               <description>Bit set register</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN2INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x9c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN3CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0xa4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN3SET</name>
               <description>Bit set register</description>
               <addressOffset>0xa8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN3INV</name>
               <description>Bit invert register</description>
               <addressOffset>0xac</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN4CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0xb4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN4SET</name>
               <description>Bit set register</description>
               <addressOffset>0xb8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGPCLKGEN4INV</name>
               <description>Bit invert register</description>
               <addressOffset>0xbc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>USER_IDCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0xc4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>USER_IDSET</name>
               <description>Bit set register</description>
               <addressOffset>0xc8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>USER_IDINV</name>
               <description>Bit invert register</description>
               <addressOffset>0xcc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PMD1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0xe4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PMD1SET</name>
               <description>Bit set register</description>
               <addressOffset>0xe8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PMD1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0xec</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PMD2CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0xf4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PMD2SET</name>
               <description>Bit set register</description>
               <addressOffset>0xf8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PMD2INV</name>
               <description>Bit invert register</description>
               <addressOffset>0xfc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PMD3CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PMD3SET</name>
               <description>Bit set register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PMD3INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x10c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
