Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32WM_BZ6602.svd
            <register>
               <name>PRICTRL0</name>
               <description>Priority Control 0</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x40404040</resetValue>
               <fields>
                  <field>
                     <name>LVLPRI0</name>
                     <description>Level 0 Channel Priority Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS0</name>
                     <description>Level 0 Quality of Service</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS0Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN0</name>
                     <description>Level 0 Round-Robin Scheduling Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI1</name>
                     <description>Level 1 Channel Priority Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS1</name>
                     <description>Level 1 Quality of Service</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS1Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN1</name>
                     <description>Level 1 Round-Robin Scheduling Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI2</name>
                     <description>Level 2 Channel Priority Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS2</name>
                     <description>Level 2 Quality of Service</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS2Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN2</name>
                     <description>Level 2 Round-Robin Scheduling Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI3</name>
                     <description>Level 3 Channel Priority Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS3</name>
                     <description>Level 3 Quality of Service</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS3Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN3</name>
                     <description>Level 3 Round-Robin Scheduling Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTPEND</name>
               <description>Interrupt Pending</description>
               <addressOffset>0x20</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TERR</name>
                     <description>Transfer Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCMPL</name>
                     <description>Transfer Complete</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Channel Suspend</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FERR</name>
                     <description>Fetch Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Busy</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEND</name>
                     <description>Pending</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTATUS</name>
               <description>Interrupt Status</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHINT0</name>
                     <description>Channel 0 Pending Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT1</name>
                     <description>Channel 1 Pending Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT2</name>
                     <description>Channel 2 Pending Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT3</name>
                     <description>Channel 3 Pending Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT4</name>
                     <description>Channel 4 Pending Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT5</name>
                     <description>Channel 5 Pending Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT6</name>
                     <description>Channel 6 Pending Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT7</name>
                     <description>Channel 7 Pending Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT8</name>
                     <description>Channel 8 Pending Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT9</name>
                     <description>Channel 9 Pending Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT10</name>
                     <description>Channel 10 Pending Interrupt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT11</name>
                     <description>Channel 11 Pending Interrupt</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT12</name>
                     <description>Channel 12 Pending Interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT13</name>
                     <description>Channel 13 Pending Interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT14</name>
                     <description>Channel 14 Pending Interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT15</name>
                     <description>Channel 15 Pending Interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BUSYCH</name>
               <description>Busy Channels</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BUSYCH0</name>
                     <description>Busy Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH1</name>
                     <description>Busy Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH2</name>
                     <description>Busy Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH3</name>
                     <description>Busy Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH4</name>
                     <description>Busy Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH5</name>
                     <description>Busy Channel 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH6</name>
                     <description>Busy Channel 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH7</name>
                     <description>Busy Channel 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH8</name>
                     <description>Busy Channel 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH9</name>
                     <description>Busy Channel 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH10</name>
                     <description>Busy Channel 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH11</name>
                     <description>Busy Channel 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH12</name>
                     <description>Busy Channel 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH13</name>
                     <description>Busy Channel 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH14</name>
                     <description>Busy Channel 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSYCH15</name>
                     <description>Busy Channel 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PENDCH</name>
               <description>Pending Channels</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PENDCH0</name>
                     <description>Pending Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH1</name>
                     <description>Pending Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH2</name>
                     <description>Pending Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH3</name>
                     <description>Pending Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH4</name>
                     <description>Pending Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH5</name>
                     <description>Pending Channel 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH6</name>
                     <description>Pending Channel 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH7</name>
                     <description>Pending Channel 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH8</name>
                     <description>Pending Channel 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH9</name>
                     <description>Pending Channel 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH10</name>
                     <description>Pending Channel 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH11</name>
                     <description>Pending Channel 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH12</name>
                     <description>Pending Channel 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH13</name>
                     <description>Pending Channel 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH14</name>
                     <description>Pending Channel 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDCH15</name>
                     <description>Pending Channel 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
