Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32WM_BZ6602.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="GPIOE">
         <name>GPIOD</name>
         <baseAddress>0x44002C00</baseAddress>
         <interrupt>
            <name>CHANGE_NOTICE_D</name>
            <description>PORT_D_INPUT_CHANGE_INTERRUPT</description>
            <value>7</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="GPIOE">
         <name>GPIOC</name>
         <baseAddress>0x44002B00</baseAddress>
         <interrupt>
            <name>CHANGE_NOTICE_C</name>
            <description>PORT_C_INPUT_CHANGE_INTERRUPT</description>
            <value>6</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="GPIOE">
         <name>GPIOB</name>
         <baseAddress>0x44002A00</baseAddress>
         <interrupt>
            <name>CHANGE_NOTICE_B</name>
            <description>PORT_B_INPUT_CHANGE_INTERRUPT</description>
            <value>5</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="GPIOE">
         <name>GPIOA</name>
         <baseAddress>0x44002900</baseAddress>
         <interrupt>
            <name>CHANGE_NOTICE_A</name>
            <description>PORT_A_INPUT_CHANGE_INTERRUPT</description>
            <value>4</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>HMATRIX2TOP</name>
         <version>045856.0.0</version>
         <description>HSB Matrix</description>
         <baseAddress>0x42002400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xF0</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PRAS0</name>
               <description>Priority part A for Target 0</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000003</resetValue>
            </register>
            <register>
               <name>PRBS0</name>
               <description>Priority part B for Target 0</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS1</name>
               <description>Priority part A for Target 1</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x30000300</resetValue>
            </register>
            <register>
               <name>PRBS1</name>
               <description>Priority part B for Target 1</description>
               <addressOffset>0x8C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS2</name>
               <description>Priority part A for Target 2</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <resetValue>0x03330000</resetValue>
            </register>
            <register>
               <name>PRBS2</name>
               <description>Priority part B for Target 2</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <resetValue>0x00000300</resetValue>
            </register>
            <register>
               <name>PRAS3</name>
               <description>Priority part A for Target 3</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <resetValue>0x00003000</resetValue>
            </register>
            <register>
               <name>PRBS3</name>
               <description>Priority part B for Target 3</description>
               <addressOffset>0x9C</addressOffset>
               <size>32</size>
               <resetValue>0x00000033</resetValue>
            </register>
            <register>
               <name>PRAS4</name>
               <description>Priority part A for Target 4</description>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <resetValue>0x00000030</resetValue>
            </register>
            <register>
               <name>PRBS4</name>
               <description>Priority part B for Target 4</description>
               <addressOffset>0xA4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS5</name>
               <description>Priority part A for Target 5</description>
               <addressOffset>0xA8</addressOffset>
               <size>32</size>
               <resetValue>0x00330303</resetValue>
            </register>
            <register>
               <name>PRBS5</name>
               <description>Priority part B for Target 5</description>
               <addressOffset>0xAC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS6</name>
               <description>Priority part A for Target 6</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <resetValue>0x00033303</resetValue>
            </register>
            <register>
               <name>PRBS6</name>
               <description>Priority part B for Target 6</description>
               <addressOffset>0xB4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS7</name>
               <description>Priority part A for Target 7</description>
               <addressOffset>0xB8</addressOffset>
               <size>32</size>
               <resetValue>0x00033303</resetValue>
            </register>
            <register>
               <name>PRBS7</name>
               <description>Priority part B for Target 7</description>
               <addressOffset>0xBC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS8</name>
               <description>Priority part A for Target 8</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <resetValue>0x00033303</resetValue>
            </register>
            <register>
               <name>PRBS8</name>
               <description>Priority part B for Target 8</description>
               <addressOffset>0xC4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS9</name>
               <description>Priority part A for Target 9</description>
               <addressOffset>0xC8</addressOffset>
               <size>32</size>
               <resetValue>0x00033303</resetValue>
            </register>
            <register>
               <name>PRBS9</name>
               <description>Priority part B for Target 9</description>
               <addressOffset>0xCC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS10</name>
               <description>Priority part A for Target 10</description>
               <addressOffset>0xD0</addressOffset>
               <size>32</size>
               <resetValue>0x00333330</resetValue>
            </register>
            <register>
               <name>PRBS10</name>
               <description>Priority part B for Target 10</description>
               <addressOffset>0xD4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS11</name>
               <description>Priority part A for Target 11</description>
               <addressOffset>0xD8</addressOffset>
               <size>32</size>
               <resetValue>0x00000030</resetValue>
            </register>
            <register>
               <name>PRBS11</name>
               <description>Priority part B for Target 11</description>
               <addressOffset>0xDC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS12</name>
               <description>Priority part A for Target 12</description>
               <addressOffset>0xE0</addressOffset>
               <size>32</size>
               <resetValue>0x00333303</resetValue>
            </register>
            <register>
               <name>PRBS12</name>
               <description>Priority part B for Target 12</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRAS13</name>
               <description>Priority part A for Target 13</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <resetValue>0x00033303</resetValue>
            </register>
            <register>
               <name>PRBS13</name>
               <description>Priority part B for Target 13</description>
               <addressOffset>0xEC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
