Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32WM_BZ6602.svd
            <register>
               <name>RPB11G4R</name>
               <addressOffset>0x348</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RPB11G4R</name>
                     <description>RPB11/G4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>RPB11G4RSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CCLO1</name>
                           <description>CCL/OUT1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P2</name>
                           <description>SERCOM0/PAD2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P0</name>
                           <description>SERCOM0/PAD0</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P3</name>
                           <description>SERCOM1/PAD3</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P0</name>
                           <description>SERCOM1/PAD0</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM2P2</name>
                           <description>SERCOM2/PAD2</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM2P0</name>
                           <description>SERCOM2/PAD0</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P3</name>
                           <description>SERCOM3/PAD3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P0</name>
                           <description>SERCOM3/PAD0</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO3</name>
                           <description>TCC0/WO3</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO1</name>
                           <description>TCC0/WO1</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO5</name>
                           <description>TCC0/WO5</description>
                           <value>16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO3</name>
                           <description>TCC1/WO3</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO1</name>
                           <description>TCC1/WO1</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO5</name>
                           <description>TCC1/WO5</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2WO1</name>
                           <description>TCC2/WO1</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0WO0</name>
                           <description>TC0/WO0</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC1WO1</name>
                           <description>TC1/WO1</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2WO1</name>
                           <description>TC2/WO1</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC3WO1</name>
                           <description>TC3/WO1</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC4WO1</name>
                           <description>TC4/WO1</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC5WO1</name>
                           <description>TC5/WO1</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC6WO1</name>
                           <description>TC6/WO1</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC7WO1</name>
                           <description>TC7/WO1</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC9WO0</name>
                           <description>TC9/WO0</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPICS</name>
                           <description>QSPI/CS</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD2</name>
                           <description>QSPI/DATA2</description>
                           <value>31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD1</name>
                           <description>QSPI/DATA1</description>
                           <value>32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD0</name>
                           <description>QSPI/DATA0</description>
                           <value>33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS2</name>
                           <description>TSTBUS2</description>
                           <value>34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS6</name>
                           <description>TSTBUS6</description>
                           <value>35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_CMP1</name>
                           <description>AC/CMP1</description>
                           <value>36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_CMPTOUT</name>
                           <description>AC/CMPTOUT</description>
                           <value>37</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAN1_TX</name>
                           <description>CAN1/TX</description>
                           <value>38</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FECTRL3</name>
                           <description>FECTRL3</description>
                           <value>39</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FECTRL5</name>
                           <description>FECTRL5</description>
                           <value>40</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPB12G1R</name>
               <addressOffset>0x34c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RPB12G1R</name>
                     <description>RPB12/G1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>RPB12G1RSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P3</name>
                           <description>SERCOM0/PAD3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P2</name>
                           <description>SERCOM0/PAD2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P0</name>
                           <description>SERCOM1/PAD0</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P2</name>
                           <description>SERCOM1/PAD2</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM2P3</name>
                           <description>SERCOM2/PAD3</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM2P2</name>
                           <description>SERCOM2/PAD2</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P0</name>
                           <description>SERCOM3/PAD0</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P2</name>
                           <description>SERCOM3/PAD2</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO0</name>
                           <description>TCC0/WO0</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO4</name>
                           <description>TCC0/WO4</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO0</name>
                           <description>TCC1/WO0</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO4</name>
                           <description>TCC1/WO4</description>
                           <value>16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2WO0</name>
                           <description>TCC2/WO0</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0WO1</name>
                           <description>TC0/WO1</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC1WO0</name>
                           <description>TC1/WO0</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2WO0</name>
                           <description>TC2/WO0</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC3WO0</name>
                           <description>TC3/WO0</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC4WO0</name>
                           <description>TC4/WO0</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC5WO0</name>
                           <description>TC5/WO0</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC6WO0</name>
                           <description>TC6/WO0</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC7WO0</name>
                           <description>TC7/WO0</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC8WO0</name>
                           <description>TC8/WO0</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPICS</name>
                           <description>QSPI/CS</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD3</name>
                           <description>QSPI/DATA3</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD2</name>
                           <description>QSPI/DATA2</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD1</name>
                           <description>QSPI/DATA1</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QEICCMP0</name>
                           <description>QEI/CCMP0</description>
                           <value>31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS0</name>
                           <description>TSTBUS0</description>
                           <value>32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS4</name>
                           <description>TSTBUS4</description>
                           <value>33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS8</name>
                           <description>TSTBUS8</description>
                           <value>34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FECTRL1</name>
                           <description>FECTRL1</description>
                           <value>35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FECTRL2</name>
                           <description>FECTRL2</description>
                           <value>36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COEX_BT_STATE</name>
                           <description>COEX/BT/STATE</description>
                           <value>37</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
