Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32WM_BZ6602.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>QEI</name>
         <version>014941</version>
         <baseAddress>0x44005000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xD0</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>QEI</name>
            <description>QEI</description>
            <value>50</value>
         </interrupt>
         <registers>
            <register>
               <name>QEICON</name>
               <description>QEI Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CCM</name>
                     <description>Counter Control Mode Selection bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CCMSelect</name>
                        <enumeratedValue>
                           <name>INT_TMR_EXT_COUNT</name>
                           <description>Internal timer mode with optional external count enable</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_CLOCK_EXT_COUNT</name>
                           <description>External clock count with optional external count gating</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_CLK_EXT_UPDN</name>
                           <description>External clock count with external Up/Dn direction selection</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COUNT_MODE</name>
                           <description>Quadrature Encoder Interface Count mode (x4 mode)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GATEN</name>
                     <description>External Count Gate Enable bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>GATENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>External gate signal controls position counter operation</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>External gate signal has no affect on position counter/timer operation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CNTPOL</name>
                     <description>Position and Index Counter/Timer Direction Select bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CNTPOLSelect</name>
                        <enumeratedValue>
                           <name>NEG</name>
                           <description>Counter direction is negative unless modified by external Up/Down signal</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POS</name>
                           <description>Counter direction is positive unless modified by external Up/Down signal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INTDIV</name>
                     <description>Timer Input Clock Prescale Select bits </description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>INTDIVSelect</name>
                        <enumeratedValue>
                           <name>1_128</name>
                           <description>1:128 prescale value</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_64</name>
                           <description>1:64 prescale value</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_32</name>
                           <description>1:32 prescale value</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_16</name>
                           <description>1:16 prescale value</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_8</name>
                           <description>1:8 prescale value</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_4</name>
                           <description>1:4 prescale value</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_2</name>
                           <description>1:2 prescale value</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_1</name>
                           <description>1:1 prescale value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IMV</name>
                     <description>Index Match Value bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>IMVSelect</name>
                        <enumeratedValue>
                           <name>B1_A1</name>
                           <description>Index match occurs when QEB is 1 and QEA is 1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B1_A0</name>
                           <description>Index match occurs when QEB is 1 and QEA is 0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B0_A1</name>
                           <description>Index match occurs when QEB is 0 and QEA is 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B0_A0</name>
                           <description>Index match occurs when QEB is 0 and QEA is 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIMOD</name>
                     <description>Position Counter Initialization Mode Select bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PIMODSelect</name>
                        <enumeratedValue>
                           <name>7</name>
                           <description>Modulo Count mode for position counter and every index event resets the position counter</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>Modulo Count mode for position counter</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>Resets the position counter when the position counter equals QEIICCH register</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>Second index event after home event initializes position counter with contents of QEIICCHregister</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>First index event after home event initializes position counter with contents of QEIICCH register</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Next index input event initializes the position counter with contents of QEIICCH register</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Every Index input event resets the position counter</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Index input event does not affect position counter</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QEISIDL</name>
                     <description>Stop in Idle Mode bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>QEISIDLSelect</name>
                        <enumeratedValue>
                           <name>DISCONT</name>
                           <description>Discontinue module operation when device enters Idle mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONT</name>
                           <description>Continue module operation in Idle mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Quadrature Encoder Interface Freeze debug mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ON</name>
                     <description>Quadrature Encoder Interface Module Counter Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ONSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Module counters are enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Module counters are disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>QEICONCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>QEICONSET</name>
               <description>Bit set register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>QEICONINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x0c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
