Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32WM_BZ6602.svd
            <register>
               <name>QEISTAT</name>
               <description>QEI Status Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IDXIEN</name>
                     <description>Index Input Event Interrupt Enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>IDXIENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Interrupt is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Interrupt is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IDXIRQ</name>
                     <description>Status Flag for Index Event Status bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>IDXIRQSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Index event has occurred</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>No Index event has occurred</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HOMIEN</name>
                     <description>Home Input Event Interrupt Enable bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HOMIENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Interrupt is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Interrupt is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HOMIRQ</name>
                     <description>Status Flag for Home Event Status bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HOMIRQSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Home event has occurred</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>No Home event has occurred</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VELOVIEN</name>
                     <description>Velocity Counter Overflow Interrupt Enable bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VELOVIENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Interrupt is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Interrupt is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VELOVIRQ</name>
                     <description>Velocity Counter Overflow Status bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VELOVIRQSelect</name>
                        <enumeratedValue>
                           <name>OVERFLOW</name>
                           <description>Overflow has occurred</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_OVERFLOW</name>
                           <description>No overflow has not occurred</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PCIIEN</name>
                     <description>Position Counter Initialization Process Complete Interrupt Enable bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PCIIENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Interrupt is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Interrupt is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PCIIRQ</name>
                     <description>Position Counter Initialization Process Complete Status bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PCIIRQSelect</name>
                        <enumeratedValue>
                           <name>DONE</name>
                           <description>POSxCNT was reinitialized</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_DONE</name>
                           <description>POSxCNT was not reinitialized</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POSOVIEN</name>
                     <description>Position Counter Overflow Interrupt Enable bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>POSOVIENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Interrupt is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Interrupt is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POSOVIRQ</name>
                     <description>Position Counter Overflow Status bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>POSOVIRQSelect</name>
                        <enumeratedValue>
                           <name>OVERFLOW</name>
                           <description>Overflow has occurred</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_OVERFLOW</name>
                           <description>No overflow has occurred</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PCLEQIEN</name>
                     <description>Position Counter Less Than or Equal Compare Interrupt Enable bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PCLEQIENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Interrupt is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Interrupt is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PCLEQIRQ</name>
                     <description>Position Counter Less Than or Equal Compare Status bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PCLEQIRQSelect</name>
                        <enumeratedValue>
                           <name>LESS_EQUAL</name>
                           <description>POSxCNT less than or equal to QEICMPL</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GREATER</name>
                           <description>POSxCNT greater than QEICMPL</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PCHEQIEN</name>
                     <description>Position Counter Greater Than or Equal Compare Interrupt Enable bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PCHEQIENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Interrupt is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Interrupt is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PCHEQIRQ</name>
                     <description>Position Counter Greater Than or Equal Compare Status bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PCHEQIRQSelect</name>
                        <enumeratedValue>
                           <name>MORE_EQUAL</name>
                           <description>POSxCNT greater than or equal to QEIICCH</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LESS</name>
                           <description>POSxCNT less than QEIICCH</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>QEISTATCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>QEISTATSET</name>
               <description>Bit set register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>QEISTATINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x2c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>POSCNT</name>
               <description>Position Counter Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>POSCNT</name>
                     <description>Position Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POSCNTCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>POSCNTSET</name>
               <description>Bit set register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>POSCNTINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x3c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>POSHLD</name>
               <description>Position Count Hold Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>POSHLD</name>
                     <description>Position Count Hold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POSHLDCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>POSHLDSET</name>
               <description>Bit set register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>POSHLDINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x4c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>VELCNT</name>
               <description>Velocity Counter Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VELCNT</name>
                     <description>Velocity Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VELCNTCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>VELCNTSET</name>
               <description>Bit set register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>VELCNTINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x5c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>VELHLD</name>
               <description>Velocity Counter Holding Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VELHLD</name>
                     <description>Velocity Cout Hold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VELHLDCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>VELHLDSET</name>
               <description>Bit set register</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>VELHLDINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x6c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INTTMR</name>
               <description>Interval Timer Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>INTTMR</name>
                     <description>Interval Timer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTTMRCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INTTMRSET</name>
               <description>Bit set register</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INTTMRINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x7c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INTHLD</name>
               <description>Interval Timer Holding Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>INTHLD</name>
                     <description>Interval Count Hold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTHLDCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INTHLDSET</name>
               <description>Bit set register</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INTHLDINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x8c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INDXCNT</name>
               <description>Index Counter Register</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>INDXCNT</name>
                     <description>Index Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INDXCNTCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INDXCNTSET</name>
               <description>Bit set register</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INDXCNTINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x9c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
