Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32WM_BZ6602.svd
            <register>
               <name>EFUSE_RWDATA</name>
               <description>EFuse RW Data Register</description>
               <addressOffset>0xC04</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>eFuse Program (Write) Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>eFuse Program/Read Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFUSE_CON</name>
               <description>Efuse Configuration Register2</description>
               <addressOffset>0xC08</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PGM_1BIT</name>
                     <description>eFuse CTRL to program 1 bit at a time. Valid only when EN_PGM is set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PGM_1BITSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse controller will program EFUSE_RWDATA.DATA[15:0] to the address in EFUSE_RWDATA.ADDR[11:3]</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>EFuse controller will program EFUSE_RWDATA.DATA[0] to the address in EFUSE_RWDATA.ADDR[11:0]</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PGM_MODE</name>
                     <description>eFuse Programming Mode Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PGM_MODESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse Programming disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>EFuse Programming enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_LD</name>
                     <description>eFuse Word Read Start bit for loading the fuse byte pointed by ADDR field into the holding register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EN_LDSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse Read operation has completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Start eFuse Read operation for specified eFuse word as addressed in EFUSE_RWDATA register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_LD_ALL1</name>
                     <description>eFuse Panel Read Start bit for loading into the holding registers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EN_LD_ALL1Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse Read operation has completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Start eFuse Read operation for entire eFuse panel</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_PGM</name>
                     <description>eFuse Programming Start bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EN_PGMSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse Programming operation has completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Start eFuse Programming operation</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
